{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordPiece",
    "unk_token": "[UNK]",
    "continuing_subword_prefix": "##",
    "max_input_chars_per_word": 100,
    "vocab": {
      "[UNK]": 0,
      "[PAD]": 1,
      "[SOS]": 2,
      "[EOS]": 3,
      ".": 4,
      "?": 5,
      "G": 6,
      "H": 7,
      "I": 8,
      "S": 9,
      "T": 10,
      "W": 11,
      "a": 12,
      "d": 13,
      "e": 14,
      "f": 15,
      "g": 16,
      "h": 17,
      "i": 18,
      "k": 19,
      "l": 20,
      "m": 21,
      "n": 22,
      "o": 23,
      "r": 24,
      "s": 25,
      "t": 26,
      "u": 27,
      "w": 28,
      "y": 29,
      "##r": 30,
      "##e": 31,
      "##o": 32,
      "##u": 33,
      "##l": 34,
      "##a": 35,
      "##t": 36,
      "##i": 37,
      "##n": 38,
      "##g": 39,
      "##h": 40,
      "##s": 41,
      "##m": 42,
      "##d": 43,
      "##k": 44,
      "##w": 45,
      "yo": 46,
      "you": 47,
      "Th": 48,
      "is": 49,
      "##at": 50,
      "##in": 51
    }
  }
}