{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordPiece",
    "unk_token": "[UNK]",
    "continuing_subword_prefix": "##",
    "max_input_chars_per_word": 100,
    "vocab": {
      "[UNK]": 0,
      "[PAD]": 1,
      "[SOS]": 2,
      "[EOS]": 3,
      ",": 4,
      "-": 5,
      ".": 6,
      ";": 7,
      "?": 8,
      "A": 9,
      "B": 10,
      "G": 11,
      "H": 12,
      "I": 13,
      "K": 14,
      "L": 15,
      "M": 16,
      "N": 17,
      "P": 18,
      "S": 19,
      "T": 20,
      "U": 21,
      "Z": 22,
      "a": 23,
      "b": 24,
      "c": 25,
      "d": 26,
      "e": 27,
      "g": 28,
      "h": 29,
      "i": 30,
      "k": 31,
      "l": 32,
      "m": 33,
      "n": 34,
      "o": 35,
      "p": 36,
      "s": 37,
      "t": 38,
      "u": 39,
      "v": 40,
      "w": 41,
      "z": 42,
      "’": 43,
      "“": 44,
      "”": 45,
      "##n": 46,
      "##g": 47,
      "##i": 48,
      "##a": 49,
      "##m": 50,
      "##l": 51,
      "##h": 52,
      "##k": 53,
      "##b": 54,
      "##e": 55,
      "##u": 56,
      "##t": 57,
      "##”": 58,
      "##d": 59,
      "##s": 60,
      "##o": 61,
      "##w": 62,
      "##p": 63,
      "##v": 64,
      "##S": 65,
      "##c": 66,
      "##ng": 67,
      "##ia": 68,
      "##ung": 69,
      "hi": 70,
      "##am": 71,
      "in": 72,
      "##na": 73,
      "##ang": 74,
      "##ua": 75,
      "Pa": 76,
      "ki": 77,
      "##in": 78,
      "##ah": 79,
      "##ak": 80,
      "##ei": 81,
      "##ui": 82,
      "##pi": 83,
      "Kh": 84,
      "##im": 85,
      "##ih": 86,
      "##lpi": 87,
      "##en": 88,
      "##el": 89,
      "##tung": 90,
      "##sia": 91,
      "Pasia": 92,
      "Pasian": 93,
      "Na": 94,
      "ah": 95,
      "ci": 96,
      "cia": 97,
      "dam": 98,
      "hia": 99,
      "kh": 100,
      "le": 101,
      "om": 102,
      "te": 103,
      "tung": 104,
      "tua": 105,
      "##ing": 106,
      "##an": 107,
      "##aw": 108,
      "##hna": 109,
      "##em": 110,
      "##th": 111,
      "##dam": 112,
      "##vak": 113,
      "##ungdam": 114,
      "##uavak": 115,
      "##eitung": 116
    }
  }
}